/*-- Добавление
insert into assignment(id, description, correct_query)
values (1, 'Получить полные сведения обо всех изделиях.', 'select * from j'),
(2, 'Получить полные сведения обо всех изделиях в Томске.', 'select * from j where Ci = \'Томск\''),
(3, 'Получить значение Pnum, для которой нет другой детали, имеющей меньшее значение веса.', 'select Pnum from p where We = (select min(We) from p)');

insert into J(Jnum, Jnam, Ci) values
 (1, 'J1','Томск'),
 (2, 'J2','Москва'),
 (3, 'J3','Томск'),
 (4, 'J4','Кемерово'),
 (5, 'J5','Улан-Удэ'),
 (6, 'J6','Новокузнецк'),
 (7, 'J7','Новосибирск'),
 (8, 'J8','Томск'),
 (9, 'J9','Улан-Удэ'),
 (10, 'J10','Белокуриха');

insert into P(Pnum, Pnam, We, Co, Ci) values
 (1,'P1',7.2,'Красный','Томск'),
 (2,'P2',3,'Белый','Улан-Удэ'),
 (3,'P3',4,'Синий','Белокуриха'),
 (4,'P4',10,'Красный','Новосибирск'),
 (5,'P5',6.1,'Зеленый','Кемерово'),
 (6,'P6',1.3,'Оранжевый','Гусинозерск'),
 (7,'P7',10,'Синий','Киров'),
 (8,'P8',7,'Красный','Санкт-Петербург'),
 (9,'P9',6,'Синий','Москва'),
 (10,'P10',11.2,'Белый','Томск');

insert into S(Snum, Snam, Ci) values
 (1, 'S1','Новокузнецк'),
 (2, 'S2','Сочи'),
 (3, 'S3','Киев'),
 (4, 'S4','Минск'),
 (5, 'S5','Улан-Удэ'),
 (6, 'S6','Париж'),
 (7, 'S7','Лондон'),
 (8, 'S8','Курск'),
 (9, 'S9','Новокузнецк'),
 (10, 'S10','Бразилиа');
--git*/